# ImportSymbolName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ImportSymbolName Property
ParameterTypeId Class See Also
---
"Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ImportSymbolName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportSymbolName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ImportSymbolName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace